Repository: UswaMuhammadii/Aidea-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Aidea Technology
ar: عايدية للتكنولوجيا

source: Home Services
ar: خدمات منزلية

source: Hello
ar: مرحباً

source: Login
ar: تسجيل الدخول

source: Logout
ar: تسجيل الخروج

source: Phone Number
ar: رقم الهاتف

source: What is your mobile number?
ar: ما هو رقم هاتفك المحمول؟

# enterMobileNumberToSendCode
source: Enter your mobile number to send you the activation code
ar: أدخل رقم هاتفك المحمول لإرسال رمز التفعيل إليك

source: Invalid number
ar: رقم غير صالح

source: Please enter complete OTP
ar: يرجى إدخال رمز التحقق كاملاً

source: OTP sent successfully!
ar: تم إرسال رمز التحقق بنجاح!

# enterCodeSentToYou
source: Enter the code sent to you
ar: أدخل الرمز المرسل إليك

# confirmationCodeSentTo
source: Confirmation code has been sent to
ar: تم إرسال رمز التأكيد إلى

# didntReceiveCode
source: Didn't receive the code?
ar: لم تستلم الرمز؟

source: Resend
ar: إعادة إرسال

source: Complete Your Profile
ar: أكمل ملفك الشخصي

source: Personal Information
ar: المعلومات الشخصية

source: Full Name
ar: الاسم الكامل

source: Enter your full name
ar: أدخل اسمك الكامل

source: Please enter your name
ar: الرجاء إدخال اسمك

source: Email Address
ar: عنوان البريد الإلكتروني

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني

# pleaseEnterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

source: Delivery Address
ar: عنوان التسليم

source: Street Name
ar: اسم الشارع

source: Please enter street name
ar: الرجاء إدخال اسم الشارع

source: Floor
ar: الطابق

source: Floor number
ar: رقم الطابق

source: Apartment
ar: الشقة

source: Apartment number
ar: رقم الشقة

source: Other information
ar: معلومات أخرى

source: Save address as primary
ar: حفظ العنوان كعنوان أساسي

source: Home
ar: المنزل

source: Work
ar: العمل

source: Friend
ar: صديق

# saveAndContinue
source: Save & Continue
ar: حفظ ومتابعة

source: Dashboard
ar: لوحة التحكم

source: Our Services
ar: خدماتنا

source: services
ar: خدمات

source: View all services
ar: عرض جميع الخدمات

source: Orders
ar: الطلبات

source: My Orders
ar: طلباتي

source: Active
ar: نشط

source: Previous
ar: السابق

source: No Active Orders
ar: لا توجد طلبات نشطة

source: Book your first service today!
ar: احجز خدمتك الأولى اليوم!

source: No Previous Orders
ar: لا توجد طلبات سابقة

source: Your completed orders will appear here
ar: ستظهر طلباتك المكتملة هنا

source: Book Now
ar: احجز الآن

source: Services Booked
ar: خدمات محجوزة

source: Service Booked
ar: خدمة محجوزة

source: Booking Done
ar: تم الحجز

source: Technician Assigned
ar: تم تعيين الفني

source: Work Started
ar: بدأ العمل

source: Work Done
ar: تم العمل

source: Cancelled
ar: ملغى

source: Track Order
ar: تتبع الطلب

source: View Technician Details
ar: عرض تفاصيل الفني

source: Invoices
ar: الفواتير

source: No Invoices Yet
ar: لا توجد فواتير بعد

# completeServiceToGenerateInvoices
source: Complete a service to generate invoices
ar: أكمل خدمة لإنشاء الفواتير

source: Invoice
ar: فاتورة

# invoiceNumber
source: Invoice #
ar: فاتورة رقم

source: Amount
ar: المبلغ

source: PAID
ar: مدفوع

source: Download / Share Invoice
ar: تحميل / مشاركة الفاتورة

source: Reviews
ar: التقييمات

source: My Reviews
ar: تقييماتي

source: To Review
ar: للتقييم

source: No Services to Review
ar: لا توجد خدمات للتقييم

source: Complete services to leave reviews
ar: أكمل الخدمات لترك التقييمات

source: Completed on
ar: اكتمل في

source: Write a Review
ar: اكتب تقييماً

source: No Reviews Yet
ar: لا توجد تقييمات بعد

source: Your reviews will appear here
ar: ستظهر تقييماتك هنا

source: Rate Your Experience
ar: قيّم تجربتك

source: Tap to rate
ar: اضغط للتقييم

source: Excellent!
ar: ممتاز!

source: Very Good!
ar: جيد جداً!

source: Good
ar: جيد

source: Fair
ar: مقبول

source: Poor
ar: ضعيف

# shareYourExperience
source: Share your experience (optional)...
ar: شارك تجربتك (اختياري)...

source: Cancel
ar: إلغاء

source: Submit
ar: إرسال

source: Thank you for your review!
ar: شكراً لك على تقييمك!

source: Profile
ar: الملف الشخصي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Settings
ar: الإعدادات

source: Notifications
ar: الإشعارات

source: Manage notification preferences
ar: إدارة تفضيلات الإشعارات

source: Saved Addresses
ar: العناوين المحفوظة

source: Payment Methods
ar: طرق الدفع

source: Manage payment options
ar: إدارة خيارات الدفع

# helpAndSupport
source: Help & Support
ar: المساعدة والدعم

source: Get help and contact us
ar: احصل على المساعدة واتصل بنا

source: About
ar: حول

source: App version and information
ar: إصدار التطبيق والمعلومات

source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cart
ar: السلة

source: Your cart is empty
ar: سلتك فارغة

source: Add some services to get started
ar: أضف بعض الخدمات للبدء

source: Clear All
ar: مسح الكل

source: Are you sure you want to remove all items?
ar: هل أنت متأكد أنك تريد إزالة جميع العناصر؟

source: Clear
ar: مسح

source: Total
ar: المجموع

source: Proceed to Checkout
ar: المتابعة إلى الدفع

source: Book Service
ar: حجز خدمة

source: Selected Services
ar: الخدمات المحددة

source: Upload Appliance Images
ar: تحميل صور الجهاز

source: Add Photos
ar: إضافة صور

source: Upload photos of your appliance
ar: قم بتحميل صور جهازك

source: images selected
ar: صور محددة

source: image selected
ar: صورة محددة

source: Gallery
ar: المعرض

source: Camera
ar: الكاميرا

source: Choose Image Source
ar: اختر مصدر الصورة

source: Select Date
ar: اختر التاريخ

source: Choose a date
ar: اختر تاريخاً

source: Select Time
ar: اختر الوقت

source: Choose a time
ar: اختر وقتاً

source: Service Address
ar: عنوان الخدمة

source: Enter service address
ar: أدخل عنوان الخدمة

source: Additional Notes (Optional)
ar: ملاحظات إضافية (اختياري)

source: Any special requests or notes...
ar: أي طلبات خاصة أو ملاحظات...

source: Request Summary
ar: ملخص الطلب

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Not selected
ar: غير محدد

source: Images
ar: الصور

source: No images
ar: لا توجد صور

source: Estimated Price
ar: السعر التقديري

source: Submit Request
ar: إرسال الطلب

source: Please select both date and time
ar: الرجاء تحديد كل من التاريخ والوقت

source: Please enter your address
ar: الرجاء إدخال عنوانك

source: Booking Confirmed!
ar: تم تأكيد الحجز!

source: Your service has been successfully booked
ar: تم حجز خدمتك بنجاح

# yourServicesHaveBeenSuccessfullyBooked
source: Your service has been successfully booked
ar: تم حجز خدمتك بنجاح

source: Booking Details
ar: تفاصيل الحجز

source: Service
ar: الخدمة

source: Quantity
ar: الكمية

source: Total Amount
ar: المبلغ الإجمالي

source: What's Next?
ar: ما التالي؟

# youWillReceiveConfirmationEmailShortly
source: You will receive a confirmation email shortly
ar: ستتلقى بريداً إلكترونياً للتأكيد قريباً

# reminderWillBeSent24HoursBefore
source: A reminder will be sent 24 hours before
ar: سيتم إرسال تذكير قبل 24 ساعة

# viewYourBookingsInOrdersSection
source: View your bookings in the Orders section
ar: اعرض حجوزاتك في قسم الطلبات

source: Back to Home
ar: العودة إلى الرئيسية

source: View Bookings
ar: عرض الحجوزات

source: Order Details
ar: تفاصيل الطلب

# orderNumber
source: Order #
ar: طلب رقم

source: Services List
ar: قائمة الخدمات

source: Booking Date
ar: تاريخ الحجز

source: Service Time
ar: وقت الخدمة

source: Address
ar: العنوان

source: Order Status
ar: حالة الطلب

source: Pending
ar: قيد الانتظار

source: Confirmed
ar: مؤكد

source: In Progress
ar: قيد التنفيذ

source: Completed
ar: مكتمل

source: Booking Received
ar: تم استلام الحجز

source: Simulate: Assign Technician
ar: محاكاة: تعيين فني

source: Simulate: Start Work
ar: محاكاة: بدء العمل

source: Simulate: Complete Work
ar: محاكاة: إكمال العمل

source: Technician
ar: فني

source: Orders Done
ar: الطلبات المكتملة

source: Experience
ar: الخبرة

source: View Profile
ar: عرض الملف

source: Chat
ar: محادثة

source: Faced any emergency?
ar: واجهت أي حالة طوارئ؟

source: Cancel Booking
ar: إلغاء الحجز

source: Please select reason for cancellation
ar: الرجاء تحديد سبب الإلغاء

source: Change of plans
ar: تغيير في الخطط

source: Found better service
ar: وجدت خدمة أفضل

source: Incorrect booking details
ar: تفاصيل حجز غير صحيحة

source: Emergency situation
ar: حالة طوارئ

source: Price too high
ar: السعر مرتفع جداً

source: Technician not available
ar: الفني غير متاح

source: Service no longer needed
ar: الخدمة لم تعد مطلوبة

source: Other reason
ar: سبب آخر

source: Cancellation may incur charges
ar: قد يترتب على الإلغاء رسوم

source: Keep Booking
ar: الاحتفاظ بالحجز

source: Booking Cancelled
ar: تم إلغاء الحجز

source: Your booking has been cancelled successfully
ar: تم إلغاء حجزك بنجاح

source: Reason
ar: السبب

source: Done
ar: تم

source: Vendor Profile
ar: ملف البائع

source: Professional Technician
ar: فني محترف

source: Time Period
ar: فترة زمنية

source: Profile Verified
ar: تم التحقق من الملف الشخصي

source: Police Verified
ar: تم التحقق من قبل الشرطة

source: Services Provide
ar: الخدمات المقدمة

source: Order Done
ar: طلب مكتمل

source: Type a message...
ar: اكتب رسالة...

source: No messages yet
ar: لا توجد رسائل بعد

# startConversationWith
source: Start a conversation with {name}
ar: ابدأ محادثة مع {name}

source: Just now
ar: الآن

source: Calling technician...
ar: جاري الاتصال بالفني...

# helloIWillBeArrivingIn30Minutes
source: Hello! I will be arriving in 30 minutes. Please keep the service area ready.
ar: مرحباً! سأصل خلال 30 دقيقة. يرجى إبقاء منطقة الخدمة جاهزة.

source: Okay, noted. Thank you!
ar: حسناً، تم التسجيل. شكراً لك!

# mAgo
source: {minutes}m ago
ar: قبل {minutes} د

# hAgo
source: {hours}h ago
ar: قبل {hours} س

source: Enable Notifications
ar: تفعيل الإشعارات

source: Get real-time updates about your bookings
ar: احصل على تحديثات فورية حول حجوزاتك

source: Not Now
ar: ليس الآن

source: Allow
ar: السماح

source: Notifications enabled successfully!
ar: تم تفعيل الإشعارات بنجاح

source: No Notifications
ar: لا توجد إشعارات

source: You're all caught up!
ar: أنت على اطلاع بكل شيء!

source: Mark all read
ar: تحديد الكل كمقروء

source: Clear All Notifications
ar: مسح جميع الإشعارات

# areYouSureYouWantToClearAllNotifications
source: Are you sure you want to clear all notifications? This action cannot be undone.
ar: هل أنت متأكد أنك تريد مسح جميع الإشعارات؟ لا يمكن التراجع عن هذا الإجراء.

# newNotifications
source: New
ar: جديد

# youHaveUnreadNotifications
source: You have $COUNT$ unread notifications
ar: لديك $COUNT$ إشعار غير مقروء

source: Notification deleted
ar: تم حذف الإشعار

source: Undo
ar: تراجع

source: Service Detail
ar: تفاصيل الخدمة

source: What's Included
ar: ما هو مدرج

source: Not Included
ar: غير مدرج

source: Any type of repair
ar: أي نوع من الإصلاح

source: Any type of material
ar: أي نوع من المواد

source: Ladder
ar: سلم

source: Add to Cart
ar: إضافة إلى السلة

# addedToCartSuccessfully
source: {serviceName} added to cart successfully!
ar: تمت إضافة {serviceName} إلى السلة بنجاح!

source: View Cart
ar: عرض السلة

source: Search services...
ar: البحث عن خدمات...

source: No services found
ar: لم يتم العثور على خدمات

source: Try adjusting your search terms
ar: حاول تعديل مصطلحات البحث الخاصة بك

# chooseMachineType
source: Choose your machine type
ar: اختر نوع الآلة

# viewServicesForMachines
source: View services for {type} machines
ar: عرض خدمات آلات {type}

source: Washing Machine
ar: غسالة

source: Continue to Checkout
ar: المتابعة إلى الدفع

source: Home Address
ar: عنوان المنزل

source: Editing
ar: التحرير

source: Enter your address
ar: أدخل عنوانك

source: Save
ar: حفظ

source: Address updated successfully!
ar: تم تحديث العنوان بنجاح!

source: Add New Address
ar: إضافة عنوان جديد

source: Add new address feature coming soon!
ar: ميزة إضافة عنوان جديد قريباً!

source: Save Changes
ar: حفظ التغييرات

source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

source: Please enter your phone number
ar: الرجاء إدخال رقم هاتفك

source: Phone number must contain only digits
ar: يجب أن يحتوي رقم الهاتف على أرقام فقط

source: Service Expertise
ar: الخبرة في الخدمة

# previouslyCompletedServicesBy
source: Previously completed services by {name}
ar: الخدمات المكتملة سابقاً بواسطة

# doneCount
source: done
ar: مكتمل

source: km away
ar: كم بعيداً

source: Service Location
ar: موقع الخدمة

source: AC Services
ar: خدمات مكيفات الهواء

source: Home Appliances
ar: أجهزة منزلية

source: Plumbing
ar: سباكة

source: Electric
ar: الكهرباء

source: Split AC
ar: مكيف سبليت

source: Window AC
ar: مكيف نافذة

source: Central AC
ar: مكيف مركزي

source: Refrigerator
ar: ثلاجة

source: Oven
ar: فرن

source: Stove
ar: موقد

source: Dishwasher
ar: غسالة صحون

source: Automatic
ar: أوتوماتيكي

source: Regular
ar: عادي

source: Semi-Automatic
ar: شبه أوتوماتيكي

source: Top Load
ar: تحميل علوي

source: Front Load
ar: تحميل أمامي

source: Pipe Repair
ar: إصلاح الأنابيب

source: Drain Cleaning
ar: تنظيف المصارف

source: Water Heater
ar: سخان المياه

source: Faucet Installation
ar: تركيب الحنفيات

source: Wiring
ar: الأسلاك

source: Switch & Socket
ar: المفاتيح والمقابس

source: Circuit Breaker
ar: قاطع الدائرة

source: Lighting Installation
ar: تركيب الإضاءة

source: Service Management
ar: إدارة الخدمات

source: Categories
ar: الفئات

source: Subcategories
ar: الفئات الفرعية

# servicesCount
source: $COUNT$ Services
ar: $COUNT$ خدمات

# acWashing
source: AC Washing (Cleaning indoor and outdoor unit)
ar: غسيل مكيف الهواء (تنظيف الوحدة الداخلية والخارجية)

source: Repairing leaks
ar: إصلاح التسريبات

# cleaningWithFreon
source: Cleaning all units + Freon filling
ar: تنظيف جميع الوحدات + تعبئة الفريون

# installNewAc
source: New AC installation
ar: تركيب مكيف هواء جديد

# disassembleInside
source: Disassembly and assembly (inside the house)
ar: تفكيك وتجميع (داخل المنزل)

# disassembleOutside
source: Disassembly and assembly (outside the house)
ar: تفكيك وتجميع (خارج المنزل)

# electronicBoardService
source: Disassembling and assembling an electronic board
ar: تفكيك وتجميع اللوحة الإلكترونية

# externalFanService
source: Removing and installing an external fan
ar: إزالة وتركيب المروحة الخارجية

# changeDynamo
source: Change the dynamo (external)
ar: تغيير الدينامو (الخارجي)

# acWash
source: Air conditioner wash
ar: غسيل مكيف الهواء

source: Sewer cleaning
ar: تنظيف المجاري

# installCabinetAc
source: Installing a cabinet air conditioner
ar: تركيب مكيف الهواء الخزانة

# cassetteAcInstallation
source: Cassette air conditioner installation
ar: تركيب مكيف هواء كاسيت

# changeSplitCrystal
source: Change the split interior crystal
ar: تغيير الكريستال الداخلي للسبليت

# changeInternalEngine
source: Change the internal engine dynamo
ar: تغيير دينامو المحرك الداخلي

# changeCompressor
source: Changing the compressor 36-48-60 units
ar: تغيير الضاغط 36-48-60 وحدة

# changeComponents
source: Change the cylinder - coil - cylinder - battery
ar: تغيير الأسطوانة - الملف - الأسطوانة - البطارية

# changeContactor
source: Changing and installing a contactor
ar: تغيير وتركيب الكونتاكتور

# disassembleElectronicBoard
source: Disassembling and assembling the electronic board
ar: تفكيك وتجميع اللوحة الإلكترونية

# disassembleDryingMachine
source: Disassembling and assembling the drying machine
ar: تفكيك وتجميع آلة التجفيف

# disassembleWashingMachine
source: Disassemble and assemble washing machine
ar: تفكيك وتجميع الغسالة

# doorDisassembly
source: Door disassembly and installation
ar: تفكيك وتركيب الباب

# balanceBarService
source: Balance bar disassembly and installation
ar: تفكيك وتركيب شريط التوازن

source: Water drainage maintenance
ar: صيانة تصريف المياه

source: Water flow maintenance
ar: صيانة تدفق المياه

# electricalShortCircuit
source: Electrical short circuit maintenance
ar: صيانة الدائرة القصيرة الكهربائية

source: Power supply repair
ar: إصلاح مصدر الطاقة

# disassembleTimer
source: Disassemble and assemble timer
ar: تفكيك وتجميع المؤقت

source: Compressor change
ar: تغيير الضاغط

# changeExternalFan
source: Change the external fan
ar: تغيير المروحة الخارجية

# changeInternalFan
source: Change the internal fan
ar: تغيير المروحة الداخلية

# changeHeater
source: Change the heater
ar: تغيير السخان

# changeSensor
source: Change the "Depressor" sensor
ar: تغيير مستشعر "الضاغط"

source: American Freon filling
ar: تعبئة الفريون الأمريكي

source: Indian Freon filling
ar: تعبئة الفريون الهندي

source: External leakage maintenance
ar: صيانة التسرب الخارجي

# changeTimer
source: Change and adjust the timer
ar: تغيير وضبط المؤقت

# smallCompressorReplacement
source: Refrigerator compressor replacement 1/6 - 1/5 - 1/4 - 1/3
ar: استبدال ضاغط الثلاجة 1/6 - 1/5 - 1/4 - 1/3

# largeCompressorReplacement
source: Refrigerator compressor replacement 1/2 - 3/4 - 1
ar: استبدال ضاغط الثلاجة 1/2 - 3/4 - 1

# leakRepairAmericanR134
source: External leakage maintenance + American R134 Freon filling
ar: صيانة التسرب الخارجي + تعبئة الفريون الأمريكي R134

# leakRepairAmericanR12
source: External leakage maintenance + American R12 Freon filling
ar: صيانة التسرب الخارجي + تعبئة الفريون الأمريكي R12

# leakRepairChineseR134
source: External leakage maintenance + Chinese R134 Freon filling
ar: صيانة التسرب الخارجي + تعبئة الفريون الصيني R134

# leakRepairChineseR12
source: External leakage maintenance + Chinese R12 Freon filling
ar: صيانة التسرب الخارجي + تعبئة الفريون الصيني R12

# leakRepairIndianR134
source: External leakage maintenance + Indian R134 Freon filling
ar: صيانة التسرب الخارجي + تعبئة الفريون الهندي R134

source: Change keys
ar: تغيير المفاتيح

source: Change door hinges
ar: تغيير مفصلات الباب

# ovenCleaning
source: Cleaning
ar: التنظيف

source: Smuggling maintenance
ar: صيانة التسرب

source: Microwave maintenance
ar: صيانة الميكروويف

source: Complete cleaning service
ar: خدمة تنظيف كاملة

source: Leak repair service
ar: خدمة إصلاح التسرب

# acServicesDescription
source: Professional AC installation and maintenance
ar: تركيب وصيانة مكيفات الهواء الاحترافية

# homeAppliancesDescription
source: Complete home appliance repair services
ar: خدمات إصلاح الأجهزة المنزلية الكاملة

# plumbingDescription
source: Expert plumbing services
ar: خدمات السباكة الخبيرة

# electricDescription
source: Professional electrical services
ar: خدمات كهربائية احترافية

source: Complete service with gas refill
ar: خدمة كاملة مع تعبئة الغاز

source: Professional installation
ar: تركيب احترافي

# indoorMountingService
source: Indoor mounting/dismounting
ar: تركيب/فك داخلي

# outdoorMountingService
source: Outdoor mounting/dismounting
ar: تركيب/فك خارجي

source: Control board repair
ar: إصلاح لوحة التحكم

source: External motor replacement
ar: استبدال المحرك الخارجي

source: Complete cleaning
ar: تنظيف كامل

source: Service with gas refill
ar: خدمة مع تعبئة الغاز

source: Installation service
ar: خدمة التركيب

source: Drain pipe cleaning
ar: تنظيف أنبوب الصرف

source: Cabinet installation
ar: تركيب الخزانة

source: Control board service
ar: خدمة لوحة التحكم

source: Cassette type installation
ar: تركيب نوع الكاسيت

source: Indoor unit crystal replacement
ar: استبدال الكريستال الداخلي

source: Internal motor replacement
ar: استبدال المحرك الداخلي

source: Compressor replacement (large)
ar: استبدال الضاغط (كبير)

source: Major component replacement
ar: استبدال المكونات الرئيسية

source: Contactor replacement
ar: استبدال الكونتاكتور

# balanceBarServiceDesc
source: Balance bar service
ar: خدمة شريط التوازن

source: Drain system service
ar: خدمة نظام الصرف

source: Water inlet service
ar: خدمة مدخل المياه

source: Electrical repair
ar: إصلاح كهربائي

source: Power system repair
ar: إصلاح نظام الطاقة

source: Timer repair
ar: إصلاح المؤقت

source: Dryer service
ar: خدمة المجفف

source: Compressor replacement
ar: استبدال الضاغط

source: External fan replacement
ar: استبدال المروحة الخارجية

source: Internal fan replacement
ar: استبدال المروحة الداخلية

source: Heater replacement
ar: استبدال السخان

source: Sensor replacement
ar: استبدال المستشعر

source: Fan Replacement
ar: استبدال المروحة

# professionalsService
source: Professional Service
ar: خدمة احترافية

source: Testing Included
ar: يشمل الاختبار

source: Motor Replacement
ar: استبدال المحرك

source: Quality Parts
ar: قطع غيار عالية الجودة

source: Expert Service
ar: خدمة خبيرة

source: Deep Cleaning
ar: تنظيف عميق

source: Filter Cleaning
ar: تنظيف الفلتر

source: Performance Check
ar: فحص الأداء

source: Leak Detection
ar: كشف التسرب

source: Professional Repair
ar: إصلاح احترافي

source: Teak Repair
ar: إصلاح التسرب

source: Teak Detection
ar: كشف التسرب

# professionalsRepair
source: Professional Repair
ar: إصلاح احترافي

source: Testing
ar: اختبار

source: Cleaning
ar: تنظيف

source: Gas Refill
ar: تعبئة الغاز

source: Performance Optimization
ar: تحسين الأداء

source: Indoor Unit Cleaning
ar: تنظيف الوحدة الداخلية

source: Outdoor Unit Cleaning
ar: تنظيف الوحدة الخارجية

source: Warranty Included
ar: يشمل الضمان

source: Indoor Service
ar: خدمة داخلية

source: Professional Tools
ar: أدوات احترافية

source: Safe Handling
ar: معالجة آمنة

source: Outdoor Service
ar: خدمة خارجية

source: Safety Equipment
ar: معدات السلامة

source: Expert Technicians
ar: فنيون خبراء

source: Electronic Repair
ar: إصلاح إلكتروني

source: Clean Finish
ar: إنهاء نظيف

source: Quick Service
ar: خدمة سريعة

source: Pipe Unclogging
ar: إزالة انسداد الأنابيب

source: Complete Setup
ar: إعداد كامل

source: Board Replacement
ar: استبدال اللوحة

source: Crystal Replacement
ar: استبدال الكريستال

source: Component Replacement
ar: استبدال المكونات

source: Board Repair
ar: إصلاح اللوحة

source: Dryer Repair
ar: إصلاح المجفف

source: Complete Disassembly
ar: تفكيك كامل

source: Reassembly
ar: إعادة التجميع

source: Door Repair
ar: إصلاح الباب

source: Seal Replacement
ar: استبدال السدادة

source: Alignment Check
ar: فحص المحاذاة

source: Balance Bar Replacement
ar: استبدال شريط التوازن

source: Vibration Reduction
ar: تقليل الاهتزاز

source: Pump Check
ar: فحص المضخة

source: Inlet Valve Service
ar: خدمة صمام المدخل

source: Water Flow Optimization
ar: تحسين تدفق المياه

source: Electrical Diagnosis
ar: تشخيص كهربائي

source: Wiring Repair
ar: إصلاح الأسلاك

source: Safety Check
ar: فحص السلامة

source: Component Check
ar: فحص المكونات

source: Timer Replacement
ar: استبدال المؤقت

source: Full Service
ar: خدمة كاملة

source: Expert Service
ar: خدمة خبيرة

source: Professional Service
ar: خدمة احترافية

source: Text Repair
ar: إصلاح النص

# completentialation
source: Complete Installation
ar: تركيب كامل

source: Professional Setup
ar: إعداد احترافي

source: Complete Service
ar: خدمة كاملة

source: Leak Repair
ar: إصلاح التسرب

source: Complete Installation
ar: تركيب كامل

source: Complete Service
ar: خدمة كاملة

source: Select Location
ar: اختر الموقع

source: Selected Location
ar: الموقع المحدد

# tapOnMapToSelectLocation
source: Tap on the map to select your location
ar: اضغط على الخريطة لتحديد الموقع

source: Tap to change location
ar: انقر لتغيير الموقع

source: Confirm Location
ar: تأكيد الموقع

source: Tap to select on map
ar: انقر للتحديد على الخريطة

source: Please select location from map
ar: يرجى تحديد الموقع من الخريطة

source: Tap map icon to select location
ar: انقر على أيقونة الخريطة لتحديد الموقع

source: Address Type
ar: نوع العنوان

# additionalLocationDetails
source: Additional location details (landmark, building name, etc.)
ar: تفاصيل إضافية عن الموقع (معلم، اسم المبنى، إلخ)

source: Select on Map
ar: تحديد على الخريطة

source: Choose exact location on map
ar: اختر الموقع الدقيق على الخريطة

source: Use Current Location
ar: استخدم الموقع الحالي

# detectYourCurrentLocation
source: Detect your current location automatically
ar: اكتشف موقعك الحالي تلقائياً

# continueText
source: Continue
ar: متابعة

source: Select Delivery Location
ar: اختر موقع التسليم

source: has been saved
ar: تم الحفظ

# cartWithCount
source: Cart ($COUNT$)
ar: السلة ($COUNT$)
