Repository: UswaMuhammadii/Aidea-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# dateAndTime
source: Date & Time
ar: التاريخ والوقت

source: Please select a date first
ar: الرجاء تحديد التاريخ أولاً

source: Error picking images
ar: خطأ في اختيار الصور

source: Error taking photo
ar: خطأ في التقاط الصورة

source: Other
ar: أخرى

source: years
ar: سنوات

source: Qty
ar: الكمية

source: Electrical Services
ar: خدمات كهربائية

source: Split AC Services
ar: خدمات مكيف سبليت

source: Window AC Services
ar: خدمات مكيف شباك

source: Package AC Services
ar: خدمات مكيف باكج

source: Washing Machine Services
ar: خدمات الغسالات

source: Refrigerator Services
ar: خدمات الثلاجات

source: Oven Services
ar: خدمات الأفران

source: Pipe Leak
ar: تسرب الأنابيب

source: Clogged Drains
ar: مصارف مسدودة

source: Faucet Repair
ar: إصلاح الحنفيات

source: Wiring Problems
ar: مشاكل الأسلاك

source: Switch Repair
ar: إصلاح المفاتيح

source: Outlet Repair
ar: إصلاح المنافذ

# acCleaning
source: AC Washer (cleaning the internal and external unit)
ar: غسيل مكيف الهواء (تنظيف الوحدة الداخلية والخارجية)

# acCleaningDescription
source: Split AC - Complete cleaning service
ar: مكيف سبليت - خدمة تنظيف كاملة

# acLeakRepair
source: Leak repair
ar: إصلاح التسريب

# acWithGasRefill
source: Disassemble and assemble electronic board
ar: تفكيك وتجميع اللوحة الإلكترونية

# acInstallation
source: New AC installation
ar: تركيب مكيف هواء جديد

# acIndoorMounting
source: Indoor mounting/dismounting
ar: تركيب/فك داخلي

# acOutdoorMounting
source: Outdoor mounting/dismounting
ar: تركيب/فك خارجي

source: External motor change
ar: تغيير المحرك الخارجي

# acFullCleaning
source: Cleaning all units + Freon filling
ar: تنظيف جميع الوحدات + تعبئة الفريون

# cleaningAllUnitsGasRefill
source: Cleaning all units + Freon filling
ar: تنظيف جميع الوحدات + تعبئة الفريون

# mountingService
source: Cabinet installation
ar: تركيب الخزانة

# controlBoardRepairService
source: Disassemble and assemble electronic board
ar: تفكيك وتجميع اللوحة الإلكترونية

# cassetteTypeInstallationService
source: Cassette type installation
ar: تركيب نوع الكاسيت

source: Internal crystal change
ar: تغيير الكريستال الداخلي

source: Internal motor change
ar: تغيير المحرك الداخلي

source: Large compressor change
ar: تغيير الضاغط (كبير)

# largeComponentChange
source: Large compressor change
ar: تغيير الضاغط الكبير

source: Contactor change
ar: تغيير الكونتاكتور

# notificationTitle
source: Notifications
ar: الإشعارات

source: Mark All as Read
ar: تحديد الكل كمقروء

# newNotification
source: New
ar: جديد

# youHaveUnreadNotificationsSingular
source: You have 1 unread notification
ar: لديك إشعار واحد غير مقروء

# youHaveUnreadNotificationsPlural
source: You have $COUNT$ unread notifications
ar: لديك $COUNT$ إشعارات غير مقروءة

# bookingConfirmedNotification
source: Booking Confirmed
ar: تم تأكيد الحجز

# bookingConfirmedMessage
source: Your AC Cleaning service has been confirmed for tomorrow at 10:00 AM
ar: تم تأكيد خدمة تنظيف المكيف الخاصة بك لغداً في الساعة ١٠:٠٠ صباحاً

# specialOfferNotification
source: Special Offer
ar: عرض خاص

# specialOfferMessage
source: Get 20% off on all plumbing services this weekend!
ar: احصل على خصم ٢٠٪ على جميع خدمات السباكة هذا الأسبوع!

# serviceReminderNotification
source: Service Reminder
ar: تذكير بالخدمة

# serviceReminderMessage
source: Your washing machine cleaning is scheduled for today at 2:00 PM
ar: تنظيف الغسالة مجدول اليوم في الساعة ٢:٠٠ مساءً

# serviceCompletedNotification
source: Service Completed
ar: اكتملت الخدمة

# serviceCompletedMessage
source: Your electrical repair service has been completed. Rate your experience!
ar: اكتملت خدمة الإصلاح الكهربائي. قيّم تجربتك!

# technicianAssignedNotification
source: Technician Assigned
ar: تم تعيين فني

# technicianAssignedMessage
source: Your technician Ahmed has been assigned to your AC Cleaning service
ar: تم تعيين الفني أحمد لخدمة تنظيف المكيف الخاصة بك

# workStartedNotification
source: Work Started
ar: بدأ العمل

# workStartedMessage
source: Your technician has started working on your service
ar: بدأ الفني في العمل على خدمتك

# workCompletedNotification
source: Work Completed
ar: اكتمل العمل

# workCompletedMessage
source: Your service has been completed successfully. Please review and rate!
ar: اكتملت خدمتك بنجاح. يرجى المراجعة والتقييم!

# invoiceGeneratedNotification
source: Invoice Generated
ar: تم إنشاء الفاتورة

# invoiceGeneratedMessage
source: Your invoice is ready. Total amount: SAR $AMOUNT$
ar: فاتورتك جاهزة. المبلغ الإجمالي: ريال $AMOUNT$

# timeAgoJustNow
source: Just now
ar: الآن

# timeAgoMinutesAgo
source: $COUNT$ minute ago
ar: منذ $COUNT$ دقيقة

# timeAgoMinutesAgoPlural
source: $COUNT$ minutes ago
ar: منذ $COUNT$ دقائق

# timeAgoHoursAgo
source: $COUNT$ hour ago
ar: منذ $COUNT$ ساعة

# timeAgoHoursAgoPlural
source: $COUNT$ hours ago
ar: منذ $COUNT$ ساعات

# timeAgoDaysAgo
source: $COUNT$ day ago
ar: منذ $COUNT$ يوم

# timeAgoDaysAgoPlural
source: $COUNT$ days ago
ar: منذ $COUNT$ أيام

# timeAgoWeeksAgo
source: $COUNT$ week ago
ar: منذ $COUNT$ أسبوع

# timeAgoWeeksAgoPlural
source: $COUNT$ weeks ago
ar: منذ $COUNT$ أسابيع

# timeAgoMonthsAgo
source: $COUNT$ month ago
ar: منذ $COUNT$ شهر

# timeAgoMonthsAgoPlural
source: $COUNT$ months ago
ar: منذ $COUNT$ أشهر

# currencySAR
source: SAR
ar: ريال

source: SAR
ar: ريال

source: Order ID
ar: رقم الطلب

source: Work Completed
ar: تم الانتهاء من العمل

source: Deep House Cleaning
ar: تنظيف المنزل العميق

source: Sofa Cleaning
ar: تنظيف الكنب

source: Carpet Cleaning
ar: تنظيف السجاد

source: Kitchen Deep Clean
ar: تنظيف المطبخ العميق

source: Bathroom Sanitization
ar: تعقيم الحمام

# sevenSeaterSofaCleaning
source: 7 Seater Sofa Set Cleaning
ar: تنظيف كنبة 7 مقاعد

# fiveSeaterSofaCleaning
source: 5 Seater Sofa Set Cleaning
ar: تنظيف كنبة 5 مقاعد

# sixSeaterSofaCleaning
source: 6 Seater Sofa Set Cleaning
ar: تنظيف كنبة 6 مقاعد

source: Dewan Cleaning
ar: تنظيف الديوان

source: Sofa Cum Bed Cleaning
ar: تنظيف الكنبة السرير

# tenSeaterSofaCleaning
source: 10 Seater Sofa Cleaning
ar: تنظيف كنبة 10 مقاعد

# chairCleaning
source: Chair Cleaning - 4 Seats
ar: تنظيف الكراسي - 4 مقاعد

# helloArrivingSoon
source: Hello! I will be arriving in 30 minutes. Please keep the service area ready.
ar: مرحباً! سأصل خلال 30 دقيقة. يرجى إبقاء منطقة الخدمة جاهزة.

source: Emergency contact initiated
ar: تم بدء الاتصال في حالات الطوارئ
